OpenFOAM/gasThermoCoupled-OFv2112/cases/ras/0/fluid/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            uniformFixedValue;
        uniformValue    constant (1500 0 0);
        value           $internalField;
    }
    outlet
    {
        type            zeroGradient;
    }
    cone_fluid
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    #include "wedgeAndSlip"
}

// ************************************************************************* //
