OpenFOAM/gasThermoCoupled-OFv2112/cases/ras/0/fluid/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1000;

boundaryField
{
    inlet
    {
        type            uniformFixedValue;
        uniformValue    constant 1000;
        value           $internalField;
    }
    outlet
    {
        type            subsonicSupersonicPressureOutlet;
        value           $internalField;
        p0              $internalField;
        U               U;
        phi             phi;
        psi             thermo:psi;
        gamma           1.4;
        refValue	$internalField;
        refGradient	uniform 0;
        valueFraction	uniform 1;
    }
    cone_fluid
    {
        type            zeroGradient;
    }
    #include "wedgeAndSlip"
}

// ************************************************************************* //
